# importing libraries

In [2]:
import pandas as pd
from sklearn.linear_model import LinearRegression

#  Reading CSV file

In [22]:
df=pd.read_csv('cars.csv')
df

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5    69000          18000         6
1                  BMW X5    35000          34000         3
2                  BMW X5    57000          26100         5
3                  BMW X5    22500          40000         2
4                  BMW X5    46000          31500         4
5                 Audi A5    59000          29400         5
6                 Audi A5    52000          32000         5
7                 Audi A5    72000          19300         6
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5

# Encoding using Dummies

In [7]:
cars=pd.get_dummies(df['Car Model'],prefix='car')

In [8]:
cars.head()

   car_Audi A5  car_BMW X5  car_Mercedez Benz C class
0            0           1                          0
1            0           1                          0
2            0           1                          0
3            0           1                          0
4            0           1                          0

#  Merging encoded data and csv data

In [9]:
new_df=pd.concat([df,cars],axis='columns')
new_df

,Car Model,Mileage,Sell Price($),Age(yrs),car_Audi A5,car_BMW X5,car_Mercedez Benz C class
0,BMW X5,69000,18000,6,0,1,0
1,BMW X5,35000,34000,3,0,1,0
2,BMW X5,57000,26100,5,0,1,0
3,BMW X5,22500,40000,2,0,1,0
4,BMW X5,46000,31500,4,0,1,0
5,Audi A5,59000,29400,5,1,0,0
6,Audi A5,52000,32000,5,1,0,0
7,Audi A5,72000,19300,6,1,0,0
8,Audi A5,91000,12000,8,1,0,0
9,Mercedez Benz C class,67000,22000,6,0,0,1
10,Mercedez Benz C class,83000,20000,7,0,0,1
11,Mercedez Benz C class,79000,21000,7,0,0,1
12,Mercedez Benz C class,59000,33000,5,0,0,1

#  Dropping Car Model and Mercedez Benz c class columns

In [12]:
new_df=new_df.drop(['Car Model','car_Mercedez Benz C class'],axis='columns')
new_df

    Mileage  Sell Price($)  Age(yrs)  car_Audi A5  car_BMW X5
0     69000          18000         6            0           1
1     35000          34000         3            0           1
2     57000          26100         5            0           1
3     22500          40000         2            0           1
4     46000          31500         4            0           1
5     59000          29400         5            1           0
6     52000          32000         5            1           0
7     72000          19300         6            1           0
8     91000          12000         8            1           0
9     67000          22000         6            0           0
10    83000          20000         7            0           0
11    79000          21000         7            0           0
12    59000          33000         5            0           0

#  Declaring x and y data

In [17]:
x_data=new_df.drop(['Sell Price($)'],axis='columns')
y_data=new_df['Sell Price($)']

#  Fitting x and y data

In [19]:
model=LinearRegression()
model.fit(x_data,y_data)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

#  Predicting Price of a mercedez benz that is 4 year old with mileage 45000

In [20]:
model.predict([[45000,4,0,0]])

array([36991.31721061])

#  Predicting Price of a BMW X5  that is 7 year old with mileage 86000

In [29]:
model.predict([[86000,7,0,1]])

array([11080.74313219])

# Calculating score

In [26]:
model.score(x_data,y_data)

0.9417050937281082